#ifndef _MAIN_C_
#define _MAIN_C_
/*********************************************************************************************************************/
#include "include/ca51f1_config.h"		
#include "include/ca51f1sfr.h"
#include "include/ca51f1xsfr.h"
#include "include/gpiodef_f1.h"

#include "include/uart.h"
#include "include/delay.h"
#include <intrins.h>
/*********************************************************************************************************************
	引脚控制例程
*********************************************************************************************************************/

/*********************************************************************************************************************/
void INT0_ISR(void) interrupt 0
{
				
}
void INT0_Init(void)
{
	P32F = 1 | (1<<7);	//INT0引脚设置，设为上拉输入
	EX0 = 1;			//INT0中断使能	
	IE0 = 1;			//外部中断0使能	
	IT0 = 1;	        //1:下降沿，0：上升沿	
}
/*********************************************************************************************************************/
void INT1_ISR (void) interrupt 2
{		
	
}
void INT1_Init(void)
{
	P34F = 1 | (1<<6);	//INT1引脚设置，设为下拉输入
	EX1 = 1;			//INT1中断使能	
	IE1 = 1;			//外部中断1使能	
	IT1 = 0;	        //1:下降沿，0：上升沿	
}
/*********************************************************************************************************************/
void Stop(void)
{
	I2CCON = 0; 	//关闭I2C功能，因为I2C默认是使能的，如果I2C不关闭将无法关闭IRCH时钟
	CKCON = 0; 		//关闭所有时钟
	MECON |= (1<<6);//设置FLASH进入深度睡眠状态
	PCON |= 0x02; 	//进入STOP模式
	_nop_();
	_nop_();
	_nop_();
}
/*********************************************************************************************************************/
void main(void)
{	
#ifdef SYSCLK_16MHZ					//系统时钟为16MHz,设置CKDIV为0
	CKDIV = 0;
#endif
		
	INT0_Init();
	INT1_Init();
	EA = 1;
	
//	P35F = 2;	
	while(1)
	{
		Stop();
		Delay_ms(100);	
//		P35 = ~P35;
	}	
}
#endif
