#ifndef _TS_CFG_H
#define _TS_CFG_H

//-------------------------------------------------------------------------------------------------------------------
#define DEBUG 									0 			//1:打开在线调试功能;	0:关闭在线调试功能
//注意：只有触摸键应用才支持在线调试，滑条应用不支持在线调试。
/********************************************************************************************************
说明：
触摸在线调试功能可在PC端显示当前触摸值、基准值、门限值，可在PC端设置触摸灵敏度，并导出配置文件，
此功能需配合仿真下载器及上位机工具CACHIPTOOL.exe才能使用。详细使用方法请参考相关文档说明。
********************************************************************************************************/

//-------------------------------------------------------------------------------------------------------------------
#define SUPPORT_KEY								1			//1:支持触摸按键;	0:不支持触摸按键
//-------------------------------------------------------------------------------------------------------------------


/***********触摸省电模式设置********************************************************************************************************/
#define SUPPORT_TOUCH_SLEEP_MODE				0			//1：支持  0：不支持  

#if SUPPORT_TOUCH_SLEEP_MODE
	#define ENTER_STOP_MODE_TIME				5			//进入触摸省电模式倒数时间，单位为0.5S，如定义为5，5*0.5=2.5秒，即2.5秒无触摸即进入省电模式。
	#define SLEEP_MODE_SCAN_INTERVAL_TIME		100			//扫描触摸的间隔时间，单位约为1ms，注意：此时间越长，芯片待机功耗越低，但触摸响应速度越慢。
	#define SLEEP_TOUTH_THD						5			//触摸省电模式下门限值设置，当触摸数据变化量大于此数值将退出省电模式。

	#define ENTER_SLEEP_PRINT_EN				1			//省电模式打印开关,主要是为了验证触摸是否正常进入省电模式。进入触摸省电模式时打印"sleep"，退出省电模式时打印"exit"

//注意：使能触摸省电模式后，如在某些条件不需要进入省电模式，只需要把TS_SleepEn设为0，如需要进省电模式，把TS_SleepEn设为1。
#endif
//-------------------------------------------------------------------------------------------------------------------

#define TS_ACQ_TIMES			1				//该定义表示多少次采集数据相加进行运算

//-------------------------------------------------------------------------------------------------------------------
/********************触摸数据滤波设置*********************************************************/
#define FILTER_COUNT			5		
//说明：此数值越大，数据越平滑，但是按键响应速度越慢
//-------------------------------------------------------------------------------------------------------------------


//-------------------------------------------------------------------------------------------------------------------
/*******************触摸充电和比较器基准选择***********************************************************************/
#define SOURCE_VDD				0
#define SOURCE_INNER			1

#define TK_CHARGE_REF_SELECT	SOURCE_INNER	//SOURCE_VDD: 触摸充电电源选择为VDD,比较器基准为VDD分压 SOURCE_INNER：触摸充电电源为内部运放，比较器基准为内部基准			
//注意：一般在芯片供电存在低频干扰时选择为SOURCE_INNER，当选择为SOURCE_INNER后，芯片静态电流会增加1~2mA. 		

#if (TK_CHARGE_REF_SELECT == SOURCE_VDD)
	#define VRS_VAL				3				//比较器阈值，取值范围为：0~7，数值越大，比较器阈值电压越低。
#elif (TK_CHARGE_REF_SELECT == SOURCE_INNER)
	#define VDS_VAL				1				//触摸内部运放输出电压选择，可选范围：0~3，0：2V   1：2.5V  2：3V  3：4V
	#define VIRS_VAL			1		  		//触摸比较器阈值电压选择，可选范围：0~3，0：1V   1：1.6V  2：2V  3：2.4V
#endif
#define TKDIV_VAL				1				//触摸充放电时钟分频系数，取值范围为：0~7，对应的时钟频率为：4M~500K，此数值越大，频率越低。
#define TKTMS_VAL				15				//放电时间定义，取值范围为：1~31，数值越大，放电时间越长。
#define TK_PC_VAL				1				//触摸按键未采样通道输出控制
/*
	说明：
	1.	当设置为内部运放及内部基准时（即TK_CHARGE_REF_SELECT==SOURCE_INNER），内部运放电压要大于比较器阈值电压，即VDS_VAL定义的电压要大于VIRS_VAL定义的电压。
	2. 	当设置为内部运放及内部基准时（即TK_CHARGE_REF_SELECT==SOURCE_INNER），内部运放电压要比芯片供电电压低0.5V以上，否则运放电压可能不稳定。
	3.	当设置为内部运放及内部基准时（即TK_CHARGE_REF_SELECT==SOURCE_INNER），芯片供电至少要接10uF以上电容。
*/
//-------------------------------------------------------------------------------------------------------------------
#define POWER_ON_WAIT_TK_STABLE_EN				0	//上电后等待触摸稳定后再设置触摸环境值初值
//---------------------------------------------------------------------------------------------------
#define TK_BASE_TRIM_WHILE_KEY_PRESSED			0	//在触摸按键按下时，该触摸通道仍以内部参考通道为参考实时更新环境值，此功能可解决某些应用中，因长时间连续快速触摸按键导致该触摸通道无法更新环境值，从而导致触摸按键无效或灵敏度发生改变的问题。
//注意： 如果TK_CAP引脚所接电容为普通电容（温度特性校差），触摸工作后长期快速按触摸键一段时间后，触摸键有可能会长期触发，打开此功能可解决这种情况。
//---------------------------------------------------------------------------------------------------
#define TK_FREQ_JUMP_EN				0	//跳频功能使能开关，打开跳频功能对于CS认证测试性能有较大提升，但会降低触摸采集速度，可能对触摸按键响应时间有一定影响

#if TK_FREQ_JUMP_EN
	#define FAEN_V					1	
#else
	#define FAEN_V					0	
#endif

//-----------------触摸键应用设置--------------------------------------------------------------------------------------------------
#if SUPPORT_KEY
#define GENERATE_TS_KEY_EN						0		//根据KeysFlagSN状态产生触摸键消息TS_Key使能，如果不需要产生TS_Key，用户可直接根据KeysFlagSN来判断按键状态。
#if GENERATE_TS_KEY_EN
	#define GENERATE_DOUBLE_KEY_EN				0		//产生复合键
	#define PRINT_TS_KEY_EN						0		//打印触摸按键值开关
#endif

/***********上电再盖上触摸面板功能操作开关定义*******************************************************************************************************/
#define SUPPORT_COVER_PANAL_AFTER_POWERON		0		//1:支持上电再盖上触摸面板    0：不支持
#if SUPPORT_COVER_PANAL_AFTER_POWERON
	#define PANAL_COVER_JUDGE_TIME				2		//单位为15.625ms
	#define JUDGE_TK_NUM						(KEY_CH_COUNT-2)		
#endif
/*
说明：
	1.上电后再盖上触摸面板，一般情况下会有多个按键触摸数值变化量超过或接近触摸门限值，为了防止此类操作产生误动作，在检测到多个按键超过或接近触发门限值时，设置按键无效并重置触摸功能。
	2.使用该功能的条件：KEY_CH_COUNT要大于2
*/
/*******************************************************************************************************************************/

//-------------------------------------------------------------------------------------------------------------------
/********触摸按键通道及触发门限值定义***********************************************************/
#define KEY_CH_COUNT			1			//触摸按键数量，必须正确填写

	#define KEY_SEQ       	\
	{TS_CH3 , 100 },      	\

/************************************************************************************************
说明：
1：	{TS_CHx, XX}
	   |	  |
	   |	  |	
	   |	  -------------->对应触摸通道的门限值，当触摸数据变化量大于此数值时，按键触发。
	   --------------------->触摸通道序号。
	
2：	以上触摸门限值可在触摸在线调试模式下由上位机软件(CACHIP_TOOL.exe)导出。
************************************************************************************************/
	
/***********NOISE门限值定义************************************************************************************/
#define NOISE_THRESHOLD  				25		//此门限值可设置为触摸按键门限值的1/4 ~ 1/2
/*************************************************************************************************************/	
	
#define ANTI_SPEAKER_EN					0		//抗对讲机干扰使能开关，此功能主要是利用内部触摸参考通道来判断电源是否受对讲机干扰，如果是电源受对讲机干扰而误产生按键，则产生的按键丢弃。

#if ANTI_SPEAKER_EN
	#define REF_CH_ABNORMAL_THD			8		//定义内部参考通道数值变化多少才认为是有对讲机干扰
#endif

//-------------------------------------------------------------------------------------------------------------------

#define TOUCH_SENSITIVITY_AUTO_BALANCE_EN			1

//-------------------------------------------------------------------------------------------------------------------
/***********触摸按键消抖及按键输出时间定义************************************************************************************/	
#define FINGER_TOUCH_CONFIRM_TIME					2 		//触摸按键按下确认时间，单位为15.625ms
#define FINGER_TOUCH_RELEASE_CONFIRM_TIME			2 		//触摸按键释放确认时间，单位为15.625ms
#define FINGER_LONG_TOUCH_TIME_LIMIT				60    	//限制按键输出时间，单位为0.5s，若定义为0，则关闭此功能	
//-------------------------------------------------------------------------------------------------------------------

//-------------------------------------------------------------------------------------------------------------------
/***********环境值更新速度设置********************************************************/
#define AREA_PNOISE_PLUS_CONFIRM_TIME				100 	//单位为15.625ms
#define AREA_PNOISE_CONFIRM_TIME					80 		//单位为15.625ms
#define AREA_NNOISE_CONFIRM_TIME					30 		//单位为15.625ms
#define AREA_OVERLOW_CONFIRM_TIME					30 		//单位为15.625ms

//说明：一般情况下，环境值更新速度设置用户不需要设置，保持默认值即可。
//-------------------------------------------------------------------------------------------------------------------
#else
#define KEY_CH_COUNT    							0
#endif
		
#define OPENED_TS_COUNT							(KEY_CH_COUNT)


#if (!SUPPORT_KEY)		
	#undef DEBUG		
	#define DEBUG 0
#endif
#if DEBUG
	#ifdef UART_EN
	 #error	"请在ca51f1_config.h中关闭宏定义UART_EN!"
	#endif

	#undef SUPPORT_TOUCH_SLEEP_MODE				//省电模式不支持触摸在线调试，所以要关闭省电模式
	#define SUPPORT_TOUCH_SLEEP_MODE			0
#endif
#define TK_Debug_UartPutChar			Uart_PutChar
#endif
//-------------------------------------------------------------------------------------------------------------------
