//********************************************************* 
/* 文件名: TEST_62F08x_IO_INTERRUPT.c
* 功能：   FT62F08x_IO_INTERRUPT 功能演示
* IC:      FT62F088 LQFP32
* 内部：   16M
* empno:   500                                
* 说明：   外部PC3引脚电平变化中断使PB3输出0.75uS脉冲
*
* 参考原理图 TEST_62F08x_sch.pdf
*/
//*********************************************************
#include "SYSCFG.h"
//***********************宏定义****************************
#define  DemoPortOut	PB3   
/*-------------------------------------------------
 *  函数名：interrupt ISR
 *	功能：  中断处理函数
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/
void interrupt ISR(void)           
{ 
	if(EPIF0 & 0x08)                	
	{
		EPIF0 = 0x08;                   	//写1清零标志位 
                    
		DemoPortOut=1;
        NOP();
        NOP();
        NOP();
        NOP();
        NOP();
        DemoPortOut=0;
	} 
}  
/*-------------------------------------------------
 *  函数名：POWER_INITIAL
 *	功能：  上电系统初始化
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/	
void POWER_INITIAL (void) 
{
	OSCCON = 0B01110001;	//IRCF=111=16MHz 1：1
	INTCON = 0;  			//暂禁止所有中断
    
	PORTA = 0B00000000;		
	TRISA = 0B00000000;		//PA输入输出 0-输出 1-输入
	PORTB = 0B00000000;		
	TRISB = 0B00000000;		//PB输入输出 0-输出 1-输入  PB3输出		
	PORTC = 0B00000000; 	
	TRISC = 0B00001000;		//PC输入输出 0-输出 1-输入  PC3输入	
    PORTD = 0B00000000;		
	TRISD = 0B00000000;		//PD输入输出 0-输出 1-输入
	
	WPUA = 0B00000000;     	//PA端口上拉控制 1-开上拉 0-关上拉
	WPUB = 0B00000000;     	//PB端口上拉控制 1-开上拉 0-关上拉
	WPUC = 0B00001000;     	//PC端口上拉控制 1-开上拉 0-关上拉
	WPUD = 0B00000000;     	//PD端口上拉控制 1-开上拉 0-关上拉
    
    WPDA = 0B00000000;     	//PA端口下拉控制 1-开下拉 0-关下拉
	WPDB = 0B00000000;     	//PB端口下拉控制 1-开下拉 0-关下拉
	WPDC = 0B00000000;     	//PC端口下拉控制 1-开下拉 0-关下拉
	WPDD = 0B00000000;     	//PD端口下拉控制 1-开下拉 0-关下拉
    
    PSRC0 = 0B11111111;  	//PORTA,PORTB源电流设置最大
    PSRC1 = 0B11111111;    	//PORTC,PORTD源电流设置最大    
    
    PSINK0 = 0B11111111;  	//PORTA灌电流设置最大 0:最小，1:最大
    PSINK1 = 0B11111111; 	//PORTB灌电流设置最大 0:最小，1:最大
    PSINK2 = 0B11111111;	//PORTC灌电流设置最大 0:最小，1:最大
    PSINK3 = 0B11111111;	//PORTD灌电流设置最大 0:最小，1:最大
	
    ANSELA = 0B00000000;    //全为数字管脚
}
/*-------------------------------------------------
 *  函数名：IO_INT_INITIAL
 *	功能：  初始化IO口中断
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/
void IO_INT_INITIAL(void)
{
	EPS0=0B10000000; 		//选择PC3管脚中断
    //Bit[7:0]:Px[3:0]中断管脚选择
    EPS1=0B00000000;
    //Bit[7:0]:Px[7:4]中断管脚选择
    
    ITYPE0 = 0B11000000;	//双沿中断
    ITYPE1 = 0B00000000;
    
    EPIE0 = 0B00001000;		//使能中断3
    
    INTCON = 0B11000000;
}
/*-------------------------------------------------
 *  函数名：main 
 *	功能：  主函数
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/
void main(void)
{
	POWER_INITIAL();		//系统初始化
    IO_INT_INITIAL();
    
	while(1)
	{
		NOP();
    }
}