//********************************************************* 
/* 文件名：TEST_60F01x_Timer0.c
* 功能：   FT60F01x-Timer0功能演示
* IC:      FT60F011A SOP8
* 晶振：   16M/4T                    
* 说明：   DemoPortOut输出30Hz占空比50%的波形-Timer0实现
*
*                  FT60F011A  SOP8 
*                 ----------------
*  VDD-----------|1(VDD)    (GND)8|------------GND     
*  NC------------|2(PA2)    (PA4)7|----DemoPortOut 
*  NC------------|3(PA1)    (PA5)6|-------------NC
*  NC------------|4(PA3)    (PA0)5|-------------NC
*			      ----------------
*/
//*********************************************************
#include "SYSCFG.h"
//***********************宏定义****************************
#define  unchar         unsigned char 

#define  DemoPortOut	PA4   
/*-------------------------------------------------
 * 函数名：interrupt ISR
 * 功能：  TMR0中断处理函数
 * 输入：  无
 * 输出：  无
 --------------------------------------------------*/
void interrupt ISR(void)			
{ 
	if(T0IE && T0IF)					//16.384ms翻转一次≈30Hz
	{
		T0IF = 0;
		DemoPortOut = ~DemoPortOut; 	//翻转电平
	} 
} 
/*-------------------------------------------------
 * 函数名：POWER_INITIAL
 * 功能：  上电系统初始化
 * 输入：  无
 * 输出：  无
 --------------------------------------------------*/	
void POWER_INITIAL (void) 
{
	OSCCON = 0B01110000;				//IRCF=111=16MHz/4T=4MHz,0.25us                           
	INTCON = 0;  						//暂禁止所有中断
	OPTION = 0B00001000;				//Bit3=1,WDT MODE,PS=000=WDT RATE 1:1

	PORTA = 0B00000000;					
	TRISA = 0B00000000;					//PA输入输出 0-输出 1-输入
                                        //PA4-OUT
	WPUA = 0B00000000;     				//PA端口上拉控制 1-开上拉 0-关上拉						
	MSCKCON = 0B00000000;
	//Bit4=0,禁止LVR(60F01x O版之前)       
	//Bit4=0,LVREN使能时,开启LVR(60F01x O版及O版之后)  
    //Bit4=1,LVREN使能时,工作时开启LVR,睡眠时自动关闭LVR(60F01x O版及O版后)       
}
/*----------------------------------------------------
 * 函数名：TIMER0_INITIAL
 * 功能：  初始化设置定时器0
 * 设置TMR0定时时长=1/系统时钟频率*4*预分频值*255
                    =(1/16000000)*4*256*255=16.32ms                    
 ----------------------------------------------------*/
void TIMER0_INITIAL (void)  
{
	OPTION = 0B00000111;	 			//时钟源为指令时钟，预分频比为1:256
	//Bit5:	T0CS Timer0时钟源选择 
	//		1-外部引脚电平变化T0CKI 0-内部时钟(FOSC/4)
	//Bit4:	T0SE T0CKI引脚触发方式 1-下降沿 0-上升沿
	//Bit3:	PSA 预分频器分配位 0-Timer0 1-WDT 
	//Bit[2:0]:PS 8位预分频比 111 - 1:256
	T0IF = 0;							//清空T0软件中断
}
/*-------------------------------------------------
 * 函数名: main 
 * 功能：  主函数
 * 输入：  无
 * 输出：  无
 --------------------------------------------------*/
void main()
{
	POWER_INITIAL();		 //系统初始化
	TIMER0_INITIAL();        //Timer0初始化
	GIE = 1; 				 //开全局中断
	T0IE = 1;				 //开Timer0中断
	while(1)
	{
		NOP();
	}
}