//********************************************************* 
/* 文件名: TEST_61F02x_Timer0.c
* 功能：   FT61F02x-Timer0功能演示
* IC:      FT61F023 SOP16
* 晶振：   16M/2T                    
* 说明：   DemoPortOut输出60Hz占空比50%的波形-Timer0实现
*
*                  FT61F023  SOP16 
*                 ----------------
*  VDD-----------|1(VDD)   (VSS)16|-----------GND     
*  NC------------|2(PA7)   (PA0)15|------------NC 
*  NC------------|3(PA6)   (PA1)14|------------NC
*  NC------------|4(PA5)   (PA2)13|------------NC
*  NC------------|5(PC3)   (PA3)12|---DemoPortOut
*  NC------------|6(PC2)   (PC0)11|------------NC
*  NC------------|7(PA4)   (PC1)10|------------NC
*  NC------------|8(PC5)   (PC4)09|------------NC
*			      ----------------
*/
//*********************************************************
#include "SYSCFG.h"
//***********************宏定义****************************
#define  DemoPortOut	PA3   
/*-------------------------------------------------
 *  函数名：interrupt ISR
 *	功能：  定时器0的中断处理
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/
void interrupt ISR(void)			
{ 
	if(T0IE && T0IF)				//8.16ms翻转一次≈60Hz
	{
		T0IF = 0;
		DemoPortOut = ~DemoPortOut; //翻转电平
	} 
} 
/*-------------------------------------------------
 *  函数名：POWER_INITIAL
 *	功能：  上电系统初始化
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/	
void POWER_INITIAL (void) 
{
	OSCCON = 0B01110001;			//IRCF=111=16MHz/2=8MHz,0.125us
	INTCON = 0;  					//暂禁止所有中断
	PORTA = 0B00000000;				
	TRISA = 0B00000000;				//PA输入输出 0-输出 1-输入
									//PA3->输出
	PORTC = 0B00000000; 			
	TRISC = 0B00000000;				//PC输入输出 0-输出 1-输入  
	WPUA = 0B00000000;     			//PA端口上拉控制 1-开上拉 0-关上拉
	WPUC = 0B0000000;     			//PC端口上拉控制 1-开上拉 0-关上拉

	OPTION = 0B00001000;			//Bit3=1,WDT MODE,PS=000=WDT RATE 1:1
	MSCKCON = 0B00000000;
	//Bit6->0,禁止PA4，PC5稳压输出
	//Bit5->0,TIMER2时钟为Fosc
	//Bit4->0,禁止LVR 
    CMCON0 = 0B00000111; 			//关闭比较器，CxIN为数字IO口
}
/*-------------------------------------------------
 *	函数名称：	TIMER0_INITIAL
 *	功能：    	初始化设置定时器0
 *	设置TMR0定时时长=(1/系统时钟频率)*指令周期*预分频值*255
 *					=(1/16000000)*2*256*255=8.16ms                      
 -------------------------------------------------*/
void TIMER0_INITIAL (void)  
{
	OPTION = 0B00000111;
    //Bit5: 	T0CS Timer0时钟源选择 
	//			1-外部引脚电平变化T0CKI 0-内部时钟(FOSC/2)
	//Bit4: 	T0CKI引脚触发方式 1-下降沿 0-上升沿
	//Bit3: 	PSA 预分频器分配位 0-Timer0 1-WDT 
	//Bit[2:0]: PS2 8个预分频比 111 - 1:256

	T0IF = 0;						//清空T0软件中断
}
/*-------------------------------------------------
 *  函数名：main 
 *	功能：  主函数
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/
void main()
{
	POWER_INITIAL();				//系统初始化
	TIMER0_INITIAL(); 
	GIE = 1; 						//开中断
	T0IE = 1;						//开定时器/计数器0中断
	while(1)
	{
		NOP(); 
	}
}